#include <stdio.h>

/*
 多维数组只是一种表达形式
 多维数组的成员还是一个数组
 对于多个序列要分组－－－》多维数组
 int arr[1024 * 768] = {};
 int arr2[768][1024] = {};---->二维数组
 	10900
	[100, 20]
 */

int main(void)
{
	//定义	
	int arr[4][4];
	//int arr2[] = {0,0,0,0,0,1,1,0,0,0,1,1,0,0,0,0};
	int arr3[2][4][4] = {
		{
			{0, 0, 0, 0},	
			{0, 1, 0, 0},	
			{0, 1, 1, 0},	
			{0, 0, 1, 0}
		},
		{
			{0, 0, 0, 0},	
			{0, 1, 1, 0},	
			{0, 0, 1, 1},	
			{0, 0, 0, 0}
		}
	};

	//初始化
	int arr2[4][4] = {
		{0, 0, 0, 0},	//1
		{0, 1, 1, 0},	//2
		{0, 0, 1, 1},	//3
		{0, 0, 0, 0}	//4
	};
	
	//arr2[0] ---> {0,0,0,0}
	//遍历
	for (int i = 0; i < 4; i++) {
		//每一个小数组的每一个元素	
		for (int j = 0; j < 4; j++) {
			printf("%d ", arr2[i][j]);	
		}	
		printf("\n");
	}

	//*(arr2+1)+3
	//*arr2 + 6
	//*(arr2[2]+3)---->arr2[2][3]
	//arr2[3]+2

	return 0;
}


