#if 0
循环练习
	1.读入一个整型数，求得其前n项和
		例如n = 5, 计算1+2+3...+5

	2.读入两个整型数,求得两个数之间的所有数的和
		例如num1= 100 num2 = 105 计算100+101+102+103+104+105

	3.让顾客输入会员卡号的后四位，如果会员卡号后四位的和超过20,则奖励50元购物券

	4.任意输入一个三位数，判断其是否为水仙花数(数的每一位的立方和是本身)
	例如153=1+125+27

	5.猴子吃桃问题：猴子第一天摘下若干个桃子，当即吃了一半，还不过瘾，又多吃了一个，第二天早上又将剩下的桃子吃掉一半，又多吃了一个。以后每天早上都吃了前一天剩下的一半零一个。到第10天早上想再吃时，见只剩下一个桃子了。求第一天共摘了多少。

	6.读入一个日期(年/月/日),计算出这一天是这一年中的第几天

	7.从标准输入读入一行字符(到'\n'为止)，统计其字母的个数('a'~'z' 'A'~'Z'),
	数字字符的个数('0'~'9'),剩下的都为其他，其他字符的个数

	8.从标准输入读入一个整型数,判断其是否是质数.
#endif

